[
    {
        "slug":12,
        "title":"Chana Biryani",
        "shortDesc":"Aromatic, spiced and a delicious dum cooked and layered biriyani with white chickpeas.",
        "category":"Lunch",
        "time":"40 min",
        "servings":2,
        "img":{
           "url":"https://i2.wp.com/www.vegrecipesofindia.com/wp-content/uploads/2016/01/chole-biryani-recipe.jpg",
           "height":300,
           "width":500
        },
        "ingredients":[
           "2 tbsp Ghee",
           "1 tsp Cumin Seeds",
           "3-4 Cloves",
           "1 Black Cardamom",
           "1 inch-Cinnamon Stick",
           "3-4 green Cardamom",
           "2 tbsp Ginger Garlic Paste",
           "2 large Tomatoes, chopped",
           "2 tsp Red Chilli Powder",
           "½ tsp Turmeric Powder",
           "Salt to taste",
           "½ cup Yogurt, beaten",
           "1½ cup Chickpeas, soaked & boiled",
           "½ cups Mint Leaves",
           "2-3 Green Chillies, slit",
           "½ kg Rice, soaked & half boiled with whole spices & salt",
           "Few saffron strands, soaked in water",
           "1 tsp Kewra Essence",
           "½ cup Fried Onion",
           "Coriander leaves, finely chopped"
        ],
        "recipe":[
           "Heat oil in a pan, add cumin seeds, cloves, black cardamom, cinnamon, star anise and green cardamom, cook for a minute.",
           "Add ginger garlic paste and cook till raw smell goes off.",
           "Add tomatoes, red chilli powder, turmeric powder, nutmeg powder, mace powder and salt to taste. Cook for 4-5 minutes.",
           "Add yogurt and give it a good mix as it will start curdling.",
           "Add chickpeas, mix well and cook for a minute.",
           "Add mint leaves, green chillies and half of the barista, mix well.",
           "Spread the rice evenly all over without breaking the grain.",
           "Add saffron water, kewra essence and remaining barista. Cover and cook for 15-20 minutes.",
           "Garnish with coriander leaves.",
           "Serve hot raita."
        ]
     },
     {
        "slug":16,
        "title":"Mix Veg paratha",
        "shortDesc":"Mix veg paratha is a healthy & kids friendly dish. They taste delicious & super soft. They can be eaten on their own or with raitha-pickle",
        "category":"Breakfast",
        "time":"40 min",
        "servings":"7 parathas",
        "img":{
           "url":"https://hebbarskitchen.com/wp-content/uploads/mainPhotos/mix-veg-paratha-recipe-vegetable-paratha-how-to-make-mix-veg-paratha-1-1068x1602.jpeg",
           "height":300,
           "width":500
        },
        "ingredients":[
           "2 and a 1/2 cup wheat flour ",
           "1/2 tsp salt ",
           "3 tsp oil ",
           "water to knead ",
           "2 potato, peel & cube ",
           "1 carrot, chopped ",
           "20 florets of cauliflower ",
           "15 beans, chopped ",
           "1/2 cup peas ",
           "1/2 tsp salt ",
           "2 tsp oil ",
           "1/2 tsp ginger paste ",
           "2 chilli, finely chopped ",
           "1/2 tsp garam masala",
           "1/2 tsp cumin powder",
           "1/2 tsp aamchur / dry mango powder",
           "1/2 tsp coriander seeds, crushed",
           "¼ tsp carom seeds",
           "1 pinch of asafoetida",
           "1 cup cottage cheese, grated",
           "2 tbsp coriander, finely chopped"
        ],
        "recipe":[
           "firstly, in a large bowl take 2½ cup wheat flour, ½ tsp salt and 2 tsp oil. mix well. Then add 1 cup water and knead a dough.",
           "knead to smooth and soft dough adding water as required.",
           "now grease 1 tsp oil, cover and rest for 20 minutes.",
           "For the stuffing : ",
           "firstly in a pressure cook take 2 cup water and place a vessel. Add 2 potato, 1 carrot, 20 florets gobi, 15 beans, ½ cup peas and ½ tsp salt.",
           "cover and pressure cook for 4 whistles without adding any water to the vessel.",
           "drain off the vegetables to remove any water if present. Now mash the vegetables with the help of a fork.",
           "make a smooth vegetable mix & keep it aside",
           "now in a large pan heat 2 tsp oil and saute ½ tsp ginger paste and 1 chilli. further keeping the flame on low add ½ tsp garam masala, ½ tsp cumin powder, ½ tsp mango powder, ½ tsp coriander seeds, ¼ tsp carom and pinch asafoetida.",
           "saute on low flame until spices turn aromatic. now add 1 cup grated paneer and saute for 2 minutes. further, add mashed vegetables, ¼ tsp salt and saute for 5 minutes.",
           "cook until the mixture loses its moisture and separates pan.turn off the flame and add 2 tbsp coriander leaves, mix well and allow to cool completely.",
           "To make the parathas, pinch a ball sized wheat dough and dust with some wheat flour. further, roll it in a circle of about 5 to 5.5 inches in diameter.",
           "place a ball sized prepared mix veg stuffing in the centre. take the edge and start pleating bringing to the centre.also join the pleats together and secure tight pinching off excess dough.",
           "sprinkle some wheat flour and roll slightly thick.",
           "on a hot pan place the rolled paratha and cook for a minute. flip the paratha when the base is partly cooked (after a minute).",
           "brush oil / ghee and press slightly. flip again once or twice till both the sides are cooked properly.",
           "finally, serve hot mix vegetable paratha with sauce, raita or pickle."
        ]
     },
     {
        "slug":22,
        "title":"Rajma Masala",
        "shortDesc":"Delicious and flavourfull curry made with red kidney beans aka rajma.",
        "category":"Dinner",
        "time":"40 mins",
        "servings":4,
        "img":{
           "url":"https://www.cookwithmanali.com/wp-content/uploads/2014/10/Rajma-Recipe.jpg",
           "height":300,
           "width":500
        },
        "ingredients":[
           "1.25 cups rajma, soaked in enough water overnight or use 3 cups canned kidney beans",
           "4.5 cups + ½ cup water, ½ cup to be added later on",
           "2 tablespoons oil",
           "2 bay leaves",
           "2-3 green cardamom pods",
           "3 black cardamom",
           "1-2 cinnamon stick",
           "2 onion, finely chopped",
           "1.5 tablespoons ginger-garlic paste",
           "4 tomatoes, made into a puree",
           "½ teaspoon cumin powder",
           "½ teaspoon coriander powder",
           "¼ teaspoon red chili powder, or to taste",
           "2 teaspoons rajma masala powder",
           "salt, to taste"
        ],
        "recipe":[
           "Preparation for Rajma Masala:",
           "In a large bowl soak 1.25 cups of rajma (kidney beans) in enough water for 6-8 hours, preferably overnight.",
           "In a pressure cooker add the rajma, 4.5 cups water, turmeric, salt and 2 tea bags [if using]. Stir and cook on high for 1-2 whistle, then set the heat to medium and cook for another 10-15 minutes.",
           "The rajma is done when you can easily press it between your fingers. Remove the tea bags and set aside.",
           "Heat 2 tablespoons of oil in a pan on medium heat, once the oil is hot add bay leaves, cardamom pods, cinnamon stick and black cardamom.",
           "Saute for a minute.Add finely chopped onions and cook for 2-3 minutes till translucent.",
           "Add finely chopped onions and cook for 2-3 minutes till translucent.",
           "Add ginger-garlic paste and cook till raw smell goes away. This will take 3-4 minutes.",
           "Once the ginger-garlic is done, add the fresh tomato puree and mix.",
           "Cover the pan and let it cook for 10 minutes on medium heat. Stir once or twice in between.",
           "After 10-12 minutes, the tomatoes are done when there's no raw smell.",
           "Add the dry spices - cumin powder, rajma masala coriander powder and red chilli powder. Also add the salt and mix.",
           "Cook the spices for 2 minutes or till oil starts oozing from the sides.",
           "Add the cooked rajma and mix.",
           "Add water to the curry [the same water which we used to boil the rajma]. You can add 1/2 cup more water here.",
           "Cover the pan and cook the rajma curry for 20 minutes on medium-low heat.",
           "After 20 minutes, the curry will thicken, you can adjust the consistency to preference. Switch off the flame.",
           "In a small pan, heat 1 tablespoon of ghee or oil. Once hot add ginger julienne and chopped green chilli.",
           "Saute for 1-2 minutes till they turn light brown in color.",
           "Transfer tempering to the rajma masala. Also add chopped coriander leaves, crushed kasuri methi (dried fenugreek leaves), garam masala and mix.",
           "Serve hot with rice or any Indian bread."
        ]
     }
]