[
{
    "slug":8,
    "title":"Paneer Butter Masala",
    "shortDesc":"A rich and creamy dish of paneer, tomato, butter and cashew sauce. The dish has a lovely tang coming from the tomatoes and is slightly sweet with a creamy and velvety feel to it.",
    "category":"Lunch",
    "time":"40 min",
    "servings":4,
    "img":{
       "url":"https://i2.wp.com/www.vegrecipesofindia.com/wp-content/uploads/2013/04/paneer-butter-masala-1.jpg",
       "height":300,
       "width":500
    },
    "ingredients":[
       "FOR PREPARING CASHEW PASTE:",
       "18 to 20 whole cashews",
       "⅓ cup hot water for soaking cashews",
       "FOR PREPARING TOMATO PUREE",
       "2 cups diced tomatoes or 300 grams tomatoes or 4 to 5 medium size - pureed",
       "FOR MAKING PANEER BUTTER MASALA",
       "2 tablespoons butter or 1 tablespoon oil + 1 or 2 tablespoons butter",
       "1 tej patta (indian bay leaf)",
       "1 inch ginger and 3 to 4 garlic - crushed or ground in a mortar and pestle",
       "½ to 1 teaspoon kashmiri red chili powder or deghi mirch - if using any other chilli powder you can add ¼ to ½ teaspoon",
       "1.5 cups water or add as required",
       "1 inch ginger julienned, reserve a few for garnishing",
       "1 or 2 green chili - slit (reserve a few for garnishing)",
       "200 to 250 grams paneer (cottage cheese) - cubed or diced",
       "1 teaspoon kasuri methi (dry fenugreek leaves) - optional",
       "½ to 1 teaspoon garam masala or tandoori masala",
       "2 to 3 tablespoons low-fat cream or 1 to 2 tablespoons heavy whipping cream - optional",
       "¼ to 1 teaspoon sugar - optional, add as required depending on the sourness of the tomatoes",
       "salt as required - check notes below for adding sugar",
       "FOR GARNISHING:",
       "1 to 2 tablespoons chopped coriander leaves (cilantro leaves) for garnishing - optional",
       "a few ginger julienne",
       "1 tablespoon low fat cream 1 tablespoon heavy whipping cream - optional",
       "1 to 2 teaspoons butter - optional"
    ],
    "recipe":[
       "Preparation:",
       "Soak 18 to 20 cashews in a hot water for 20 to 30 minutes. When the cashews are soaking, you can prep the other ingredients like chopping tomatoes, preparing ginger-garlic paste, slicing paneer etc.",
       "Then drain and add the soaked cashews in a blender or grinder.",
       "Add 2 to 3 tablespoons water and grind to a smooth paste without any tiny bits or pieces of cashews.",
       "In the same blender add 2 cups of diced or roughly chopped tomatoes. No need to blanch the tomatoes before blending.",
       "Blend to a smooth tomato puree. Keep aside. Don’t add any water while blending the tomatoes.",
       "Making makhani gravy:",
       "Melt butter in a pan on a low flame. Add bay leaf and fry for 2 to 3 seconds or till the oil become fragrant.",
       "Add ginger-garlic paste and saute for some seconds till the raw aroma disappears.",
       "Add the tomato puree and stir well. Cook for 5 to 6 minutes. Then add kashmiri red chili powder and stir again. Continue to saute till the oil starts to leave the sides of the tomato paste. The tomato paste will thicken considerably and will start coming together as one whole lump. ",
       "Then add cashew paste and stir well. Saute the cashew paste for a few minutes till the oil begins to leave the sides of the masala paste.",
       "The cashew paste will begin to cook fast. Approx 3 to 4 minutes on a low flame. So keep stirring non-stop.",
       "Making Paneer Butter Masala:",
       "Add water and mix very well. Simmer on a low flame.",
       "The curry will come to a boil.",
       "After 2 to 3 minutes of boiling, add ginger julienne. Reserve a few for garnishing. The curry will also begin to thicken.",
       "Add julienned ginger and green chillies, salt and sugar and simmer till the curry begins to thicken.",
       "After 3 to 4 minutes, add 1 or 2 slit green chillies. also add salt as per taste and ½ to 1 teaspoon sugar (optional). ",
       "You can add sugar from ¼ tsp to 1 teaspoon or more depending on the sourness of the tomatoes. Sugar is optional and you can skip it too. If you add cream, then you will need to add less sugar.",
       "Mix very well and simmer for a minute.",
       "After the gravy thickens to your desired consistency, then add the paneer cubes and stir gently. i keep the gravy to a medium consistency. ",
       "After that add crushed kasuri methi (dry fenugreek leaves), garam masala and cream. Gently mix and then switch off the flame."
    ]
 },
 {
    "slug":6,
    "title":"Jalebi - Indian Celebrartion Sweet",
    "shortDesc":"Jalebi is a hot favorite on any special occasion be it a birthday, wedding or festival. Jalebis, though mostly eaten by themselves, can also be soaked in warm milk.",
    "category":"Dessert",
    "time":"115 mins",
    "servings":"4-6",
    "img":{
       "url":"https://www.thespruceeats.com/thmb/_iaTjkl88lorpH96Pc7AtoVhzbQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/jalebi-deep-fried-dessert-1957798-hero-01-871fe89e15d14aa88721406c63d23ee6.jpg",
       "height":300,
       "width":500
    },
    "ingredients":[
       "2 cups flour (self-rising)",
       "1/2 teaspoon baking powder",
       "1 cup yogurt",
       "3 strands saffron",
       "1/4 teaspoon  cardamom powder",
       "3 inches vegetable oil (canola/sunflower cooking oil for deep frying)",
       "2 drops food coloring (orange)",
       "1 cup sugar",
       "2 tablespoons rosewater"
    ],
    "recipe":[
       "Gather the ingredients.",
       "Mix the flour, baking powder, yogurt, and food coloring into a batter and keep aside for 24 hours to ferment.",
       "Pour batter into a ketchup dispensing bottle.",
       "To make sugar syrup, melt the sugar with the rosewater in a small saucepan and boil to get a one thread consistency. To check for one thread consistency, carefully dip the tip of your index finger into the syrup, touch your finger and thumb together and gently tease apart. If one thread is formed between your finger and thumb, the syrup is done.",
       "Turn off the fire, add the saffron strands and cardamom and stir well.",
       "Heat the oil in a deep wok-like dish. To test for the right temperature, drop a small amount of batter into the oil. If it sizzles and rises to the top of the oil, the oil is hot enough. Keep the flame on medium at all times to ensure thorough cooking of the jalebis.",
       "Now hold the ketchup dispenser over the hot oil and squeeze the batter into the oil into a wiggly, randomly coiled circle. Squeeze out several at a time.",
       "Fry till light golden and then remove and put directly into the sugar syrup.",
       "Allow to soak for 2 to 3 minutes and then remove.",
       "Serve warm"
    ]
 },
 {
    "slug":20,
    "title":"Dum Aloo",
    "shortDesc":"Fried potatoes simmered in a spicy and savory tomato-cashew sauce infused with delicious, aromatic Indian spices",
    "category":"Dinner",
    "time":"30 min",
    "servings":4,
    "img":{
       "url":"https://www.cilantroandcitronella.com/wp-content/uploads/2015/09/vegan-potato-curry-dum-aloo-photo-1.1.jpg",
       "height":300,
       "width":500
    },
    "ingredients":[
       "FOR PRESSURE COOKING:",
       "12 baby potatoes (or large potatoes cut into small pieces)",
       "2 tablespoons and 1 teaspoon of vegetable oil, divided",
       "12 whole cashews, soaked in water for 30 minutes",
       "1/2 teaspoon fennel seeds",
       "2.5 cm (1 inch) piece of cinnamon",
       "2 green cardamom pods",
       "1 bay leaf",
       "2 cloves",
       "1 medium onion, chopped",
       "1 1/4 cm (1/2 inch) piece of ginger, chopped",
       "2 cloves of garlic, chopped",
       "2 spicy green chilies, chopped (adjust to taste)",
       "2 tomatoes, chopped",
       "1 teaspoon cumin seeds",
       "1 1/2 teaspoons chili powder",
       "2 teaspoons coriander powder",
       "1/4 teaspoon turmeric powder",
       "Salt, to taste",
       "1 cup water",
       "Fresh cilantro, to garnish"
    ],
    "recipe":[
       "Bring a medium-sized pot of water to a boil and boil the potatoes until tender but not mushy. Drain the potatoes and allow them to cool. Peel them once cool enough to handle. While to potatoes are cooking, puree the soaked cashews with a bit of water in a food processor to a thick paste.",
       "Heat one teaspoon of oil in a large pan over medium heat. Fry the potatoes until lightly browned and crispy on all sides. Set aside on a paper towel to drain.",
       "Add one tablespoon of oil to the pan and allow it to heat on high. Once the oil shimmers, reduce the heat to medium and add the fennel seeds. Fry just until the seeds crackle and darken slightly and then add in the cinnamon, cardamom, bay leaf, and cloves. Continue frying for just a few seconds until they release their aromas.",
       "Add the onion, garlic, ginger, and green chili to the spices and cook until translucent. Add the tomatoes and cook until soft. Remove the pan from the heat and allow to cool. Once cool, puree in a food processor or blender.",
       "Heat one tablespoon of oil in your pan over high heat. Once shimmering, reduce the heat to medium and add in the cumin seeds. Fry until they begin to crackle and then add in the onion-tomato puree. Cook, stirring occasionally, until the liquid has evaporated and it forms a thick paste.",
       "Add in the dry spices: chili powder, coriander, turmeric, and a pinch of salt. Allow to cook for a minute, then stir through the cashew paste",
       "Finally, add the water and bring to a boil.",
       "Poke the potatoes all over with a fork to allow the sauce to penetrate and add them to the pan.",
       " Simmer for 5 minutes or until the gravy has reached your desired consistency.",
       "Serve garnished with chopped fresh cilantro leaves."
    ]
 }
]