[
   {
      "slug":13,
      "title":"Egg Curry (Andey Ki Curry)",
      "shortDesc":"Egg curry ranks high on the list of comfort foods.",
      "category":"Lunch",
      "time":"40 min",
      "servings":"2-3",
      "img":{
         "url":"https://www.thespruceeats.com/thmb/E3KUdOBM3NEQNVwuOugWqh9PXJ8=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-1064616852-cd54f73689da45ed91f68d63035c3c86.jpg",
         "height":300,
         "width":500
      },
      "ingredients":[
         "6 hard-boiled eggs",
         "5 tbsp. cooking oil (vegetable, canola, or sunflower)",
         "2 medium-sized onion (cut into quarters)",
         "3 medium-sized tomatoes (cut into quarters)",
         "2 green chilies",
         "2 tsp. garlic paste",
         "2 tsp. ginger paste",
         "2 tsp. coriander powder",
         "1 tsp. cumin powder",
         "1 tsp. garam masala powder",
         "1/2 tsp. turmeric powder",
         "1/2 tsp. red chili powder",
         "Salt to taste"
        
      ],
      "recipe":[
       
       "Heat the remaining oil in the same pan and add the paste you just made. Fry for 2 to 3 minutes.",
 
       "Add the ginger and garlic pastes, all the dry spices (coriander powder, cumin powder, garam masala powder, turmeric powder, and red chili powder) then mix and fry till the oil begins to separate from the masala (onion-tomato-spice mix).",
 
       "Add 1 tomato and saute until it turns soft and mushy.",
 
       "Add finely chopped onions and cook for 2-3 minutes till translucent.",
 
       "Add 1 tsp cumin seeds. Let them splutter.",
 
       "Turn off the fire and garnish with chopped coriander leaves and the slit green chilies (if using). Serve hot with plain boiled Basmati rice and a vegetable side dish."
      ]
   },
 {
    "slug":6,
    "title":"Jalebi - Indian Celebrartion Sweet",
    "shortDesc":"Jalebi is a hot favorite on any special occasion be it a birthday, wedding or festival. Jalebis, though mostly eaten by themselves, can also be soaked in warm milk.",
    "category":"Dessert",
    "time":"115 mins",
    "servings":"4-6",
    "img":{
       "url":"https://www.thespruceeats.com/thmb/_iaTjkl88lorpH96Pc7AtoVhzbQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/jalebi-deep-fried-dessert-1957798-hero-01-871fe89e15d14aa88721406c63d23ee6.jpg",
       "height":300,
       "width":500
    },
    "ingredients":[
       "2 cups flour (self-rising)",
       "1/2 teaspoon baking powder",
       "1 cup yogurt",
       "3 strands saffron",
       "1/4 teaspoon  cardamom powder",
       "3 inches vegetable oil (canola/sunflower cooking oil for deep frying)",
       "2 drops food coloring (orange)",
       "1 cup sugar",
       "2 tablespoons rosewater"
    ],
    "recipe":[
       "Gather the ingredients.",
       "Mix the flour, baking powder, yogurt, and food coloring into a batter and keep aside for 24 hours to ferment.",
       "Pour batter into a ketchup dispensing bottle.",
       "To make sugar syrup, melt the sugar with the rosewater in a small saucepan and boil to get a one thread consistency. To check for one thread consistency, carefully dip the tip of your index finger into the syrup, touch your finger and thumb together and gently tease apart. If one thread is formed between your finger and thumb, the syrup is done.",
       "Turn off the fire, add the saffron strands and cardamom and stir well.",
       "Heat the oil in a deep wok-like dish. To test for the right temperature, drop a small amount of batter into the oil. If it sizzles and rises to the top of the oil, the oil is hot enough. Keep the flame on medium at all times to ensure thorough cooking of the jalebis.",
       "Now hold the ketchup dispenser over the hot oil and squeeze the batter into the oil into a wiggly, randomly coiled circle. Squeeze out several at a time.",
       "Fry till light golden and then remove and put directly into the sugar syrup.",
       "Allow to soak for 2 to 3 minutes and then remove.",
       "Serve warm"
    ]
 },
 {
    "slug":20,
    "title":"Dum Aloo",
    "shortDesc":"Fried potatoes simmered in a spicy and savory tomato-cashew sauce infused with delicious, aromatic Indian spices",
    "category":"Dinner",
    "time":"30 min",
    "servings":4,
    "img":{
       "url":"https://www.cilantroandcitronella.com/wp-content/uploads/2015/09/vegan-potato-curry-dum-aloo-photo-1.1.jpg",
       "height":300,
       "width":500
    },
    "ingredients":[
       "FOR PRESSURE COOKING:",
       "12 baby potatoes (or large potatoes cut into small pieces)",
       "2 tablespoons and 1 teaspoon of vegetable oil, divided",
       "12 whole cashews, soaked in water for 30 minutes",
       "1/2 teaspoon fennel seeds",
       "2.5 cm (1 inch) piece of cinnamon",
       "2 green cardamom pods",
       "1 bay leaf",
       "2 cloves",
       "1 medium onion, chopped",
       "1 1/4 cm (1/2 inch) piece of ginger, chopped",
       "2 cloves of garlic, chopped",
       "2 spicy green chilies, chopped (adjust to taste)",
       "2 tomatoes, chopped",
       "1 teaspoon cumin seeds",
       "1 1/2 teaspoons chili powder",
       "2 teaspoons coriander powder",
       "1/4 teaspoon turmeric powder",
       "Salt, to taste",
       "1 cup water",
       "Fresh cilantro, to garnish"
    ],
    "recipe":[
       "Bring a medium-sized pot of water to a boil and boil the potatoes until tender but not mushy. Drain the potatoes and allow them to cool. Peel them once cool enough to handle. While to potatoes are cooking, puree the soaked cashews with a bit of water in a food processor to a thick paste.",
       "Heat one teaspoon of oil in a large pan over medium heat. Fry the potatoes until lightly browned and crispy on all sides. Set aside on a paper towel to drain.",
       "Add one tablespoon of oil to the pan and allow it to heat on high. Once the oil shimmers, reduce the heat to medium and add the fennel seeds. Fry just until the seeds crackle and darken slightly and then add in the cinnamon, cardamom, bay leaf, and cloves. Continue frying for just a few seconds until they release their aromas.",
       "Add the onion, garlic, ginger, and green chili to the spices and cook until translucent. Add the tomatoes and cook until soft. Remove the pan from the heat and allow to cool. Once cool, puree in a food processor or blender.",
       "Heat one tablespoon of oil in your pan over high heat. Once shimmering, reduce the heat to medium and add in the cumin seeds. Fry until they begin to crackle and then add in the onion-tomato puree. Cook, stirring occasionally, until the liquid has evaporated and it forms a thick paste.",
       "Add in the dry spices: chili powder, coriander, turmeric, and a pinch of salt. Allow to cook for a minute, then stir through the cashew paste",
       "Finally, add the water and bring to a boil.",
       "Poke the potatoes all over with a fork to allow the sauce to penetrate and add them to the pan.",
       " Simmer for 5 minutes or until the gravy has reached your desired consistency.",
       "Serve garnished with chopped fresh cilantro leaves."
    ]
 }
]