[
    {
        "slug": 1,
        "title": "Shahi Falooda, A Traditional Indian Dessert",
        "shortDesc":"Falooda is a popular dessert not only in Mumbai (Bombay) where it is thought to have \noriginated but also in the rest of the country. This chilled \ndrink-dessert is the perfect way to cool off in the summer heat",
        "category": "Dessert",
        "time": "40 min",
        "servings": 2,
        "img": {
          "url": "https://www.thespruceeats.com/thmb/Mhgyk99axWOEn6oa2PSxp0HRt9g=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/falooda-indian-dessert-809651654-5abed1b6875db90037976925.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
          "1/2 cup fine rice vermicelli",
          "1/2 cup almonds (blanched and skins removed)",
          "1/2 cup pistachios (shelled and skins removed)",
          "1 glass chilled milk (preferably tall; same glass used for serving)",
          "2 teaspoon sugar (ground to a fine powder)",
          "3 tablespoons basil seeds",
          "6 tablespoons rose syrup",
          "2 scoops ice cream of your choice"
        ],
        "recipe": [
            "Gather the ingredients.",

            "Cook the vermicelli as you would pasta–in boiling water until cooked al dente. Strain and set aside to cool. Then chill in the refrigerator till needed.",
            
            "Cut into thin slivers a few almonds and pistachios–about 6 to 8 each. Keep aside to use as a garnish later.",
            
            "Put the milk, powdered sugar, remaining pistachios, and almonds in a blender, and blend until smooth. Chill in the refrigerator.",
            
            "Put the basil seeds in a bowl and pour enough water over them to completely submerge. They will soon start to swell and look transparent with a small dot-like black center. Strain, and keep aside in a small bowl.",
            
            "To assemble the shahi falooda, frost two tall glasses. In each glass, put half the vermicelli and half the pre-soaked sabza (basil) seeds. Pour half the milk over them.",
            
            "Put just under half the rose syrup (keep a little for garnishing) in each glass, and mix well. Add a scoop of ice cream to this, and drizzle with some more rose syrup.",
            
            "Garnish with slivered almonds and pistachios. Add a straw and long-handled spoon and serve!"
        ]
      },

      {
        "slug": 2,
        "title": "Sandesh Mishti-Bengali Dessert",
        "shortDesc":"No Bengali meal is complete without mishti or sweets and none is more loved by \nthe Bengalis than Sandesh. It is surprisingly easy to make. Being a milk-based \nsweet, Sandesh doesn’t last long so consume it as soon as possible. Given how \ntasty it is, that shouldn’t be a problem.",
        "category": "Dessert",
        "time": "15 min",
        "servings": "10-12",
        "img": {
          "url": "https://www.thespruceeats.com/thmb/AgYRI0RsZGDZIn3Dj7Rens7ZI9w=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3244991150_9c7f008761_o-5835aedf5f9b58d5b15308ce.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
            "14 oz./400 g. fresh paneer (hang to drain whey completely)",
            "10 to 12 almonds (cut into slivers)",
            "8 to 10 of pistachios (cut into slivers)",
            "4 saffron strands (more or less)",
            "1 tbsp. warm milk (to soak saffron)",
            "2 tsp. milk powder",
            "1/2 cup finely powdered sugar",
            "1/2 tsp. pistachio essence",
            "1/2 tsp. cardamom powder",
            "1 tablespoon ghee (to lightly grease molds)"
        ],
        "recipe": [
            "Gather the ingredients.",

            "Soak almond and pistachio slivers and saffron in warm milk. Keep aside to use as a topping. If the nuts do not soak up all the milk by the time you are ready to use them, drain it away before you use the nuts as a topping",
            
            "Mix the paneer and milk powder in a pan and cook on a medium flame stirring continuously for 3 to 4 minutes.",
            
            "Allow the mixture to cool.",
            
            "Add sugar, pistachio essence, and cardamom powder and mix until a smooth dough is formed.",
            
            "Put a little topping mixture (soaked almonds, pistachios and saffron strands) in each mold.",
            
            "Chill for a few hours, unmould carefully and serve"
        ]
      },

      {
        "slug": 3,
        "title": "Caramel Custard",
        "shortDesc":"This easy-to-make pudding is popular all over India but made especially well by the \nParsis, Mangaloreans (both from Western India) and the Anglo-Indians. It can be \nsteamed in a pressure cooker or baked in the oven",
        "category": "Dessert",
        "time": "2 hrs",
        "servings": "4-6",
        "img": {
          "url": "https://www.thespruceeats.com/thmb/lWfbtvVQOJvNQkyB7I1V8aFimNc=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4247062952_531b892880_o-56a510475f9b58b7d0dabe0a.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
            "4 cups full cream milk (about 1 liter)",
            "7 eggs",
            "1 cup sugar",
            "1/2 tsp. nutmeg powder",
            "1 tsp. vanilla essence"
        ],
        "recipe": [
            "Gather the ingredients.",

            "Prepare a mold/ pudding cups/ ramekin cups for the custard by greasing very lightly with butter.",
            
            "Heat 1/2 cup of sugar with 1 tsp of water in a pan till it melts and turns golden brown. Pour this caramelized sugar into the pudding mold/pudding cups/ ramekin cups and swirl to coat the sides of the mold. Keep aside to cool.",
            
            "If baking, preheat your oven now to 350 F/ 180 C/ Gas Mark 4.",
            
            "Mix the eggs and remaining sugar together in a large bowl and blend till all the sugar has dissolved. Now add the milk, vanilla essence and nutmeg and blend again.",
            
            "Pour this mixture into the mold/ pudding cups/ ramekin cups you are using, to fill them 3/4 of the way to the top.",
            
            "Cook for about 45 minutes or till the custard is firm. Test by inserting a toothpick in the center. If it comes out clean the pudding is done.",

            "When cooked, cool the pudding and then chill in the refrigerator for an hour or two.",

            "To serve, place a plate over the mold/ pudding cup/ ramekin cup, hold firmly in place and turn over gently. The pudding will turn over onto the plate, caramel side up! Pour some of the remaining caramel (if any) over the pudding and serve."
        ]
      },

      {
        "slug": 4,
        "title": "Indian Gulab Jamun",
        "shortDesc":"Gulab jamun (or gulaab jamun) is among India's most popular desserts and it's often \nreferred to as Indian doughnuts.This delicious treat consists of soft, melt-in-your-\nmouth, fried dumplings that are traditionally made of thickened or reduced milk and \nsoaked in rose-flavored sugar syrup",
        "category": "Dessert",
        "time": "50 mins",
        "servings": "4-6",
        "img": {
          "url": "https://www.thespruceeats.com/thmb/XQpLedt8URhtAAqkHXHchHn8IyQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/gulab-jamun-146275796-5835b27c3df78c6f6a855d65.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
            "6 cups water",
            "3 cups granulated sugar",
            "1 tablespoon cardamom powder",
            "2 tablespoons rose water",
            "3 cups powdered milk",
            "1 1/2 cups all-purpose flour",
            "1 1/2 teaspoons baking powder",
            "1 cup heavy cream (or double cream, thickened; approximately)",
            "Vegetable, canola, or sunflower oil (for frying)"
        ],
        "recipe": [
            "Gather the ingredients.",

            "In a deep pan, mix the water and sugar and boil until all the sugar is dissolved.",
            
            "Turn off the heat and add the cardamom powder and rose water. Mix well and set aside.",
            
            "In a large bowl, mix the powdered milk, flour, and baking powder well.",
            
            "Add a little of the thickened cream at a time and knead to make a dough that is medium-soft but not sticky. You do not need to use all the cream, just enough to reach the desired consistency; the smoother it is, the better.",
            
            "Once the dough is ready, divide it into walnut-sized balls and roll between lightly greased palms until smooth. Any cracks that show up get worse later and could lead to the 'milk balls' cracking as they are fried. This is not desirable, so take all the time you need for this step in order to get it right.",
            
            "While you are making the balls, heat the oil for deep frying in a wide pan on low to medium heat.",

            "Fry the dumplings, stirring often to brown on all sides. Do not cook on very high heat as the dumplings will burn on the outside and remain raw inside.",

            "Once cooked, drain with a slotted spoon while removing the dumplings from the oil and transfer immediately into the rose syrup.",

            "Repeat this until all the dumplings are cooked and in the syrup.",

            "Allow the dumplings to soak in the syrup for at least 2 hours before serving. "
        ]
      },

      {
        "slug": 5,
        "title": "Malabi Rose Water Milk Pudding",
        "shortDesc":"The iconic Israeli dessert, known as malabi, has its roots in centuries-old recipes \nfor puddings made of rice flour and almond or cow's milk - which can be found \nthroughout the Middle East, Turkey, and Mediterranean Europe. A close cousin of \nmuhallabia, as the spoon sweet is known in the Arab world, today's Israeli malabi is \noften made with cornstarch instead of rice flour. Silky textured and light, the \nflower-scented pudding is topped with sweet syrup and nuts or shredded coconut.",
        "category": "Dessert",
        "time": "15 mins",
        "servings": "6-8",
        "img": {
          "url": "https://www.thespruceeats.com/thmb/hQ3Ezp__H72WJp-6iCRebCyoWr0=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/malabi-rosewater-milk-pudding-4163433-hero-01-2392fd6122b4476eba90be42540a8ac5.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
            "3 cups whole milk (2% milk is also fine; divided)",
            "1/4 cup cornstarch",
            "1 tablespoon rose water",
            "1/3 cup sugar"
        ],
        "recipe": [
            "Gather the ingredients.",

            "In a small bowl, combine 1/2 cup of the milk with the cornstarch and 1 tablespoon of rose water. Mix well with a fork or clean fingers, until the mixture is smooth and lump-free. (The cornstarch may be hard to stir at first, but will loosen as you mix.) Set aside.",
            
            "In a medium saucepan, combine the remaining 2 1/2 cups of milk with the sugar. Bring to a boil over medium-high heat, stirring frequently, until the sugar dissolves.",
            
            "When bubbles begin to break the surface, reduce the heat to low. Give the cornstarch mixture a stir, and add it to the simmering milk, stirring constantly.",
            
            "Cook the pudding at a gentle simmer, stirring very frequently, until it thickens enough to coat the back of the spoon, about 5 to 7 minutes. (If you're not stirring constantly, try not to scrape the bottom of the pan, or you may end up with lumps in your pudding.)",
            
            "Pour or spoon the malabi into 6 to 8 serving dishes. Allow to cool slightly, cover with plastic wrap, and refrigerate for at least 3 hours (the pudding will firm up as it cools)."
       
        ]
      },

      {
        "slug": 6,
        "title": "Jalebi - Indian Celebrartion Sweet",
        "shortDesc":"Jalebi is a hot favorite on any special occasion be it a birthday, wedding or festival. \nJalebis, though mostly eaten by themselves, can also be soaked in warm milk.",
        "category": "Dessert",
        "time": "115 mins",
        "servings": "4-6",
        "img": {
          "url": "https://www.thespruceeats.com/thmb/_iaTjkl88lorpH96Pc7AtoVhzbQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/jalebi-deep-fried-dessert-1957798-hero-01-871fe89e15d14aa88721406c63d23ee6.jpg",
          "height": 200,
          "width": 400
        },
        "ingredients": [
            "2 cups flour (self-rising)",
            "1/2 teaspoon baking powder",
            "1 cup yogurt",
            "3 strands saffron",
            "1/4 teaspoon  cardamom powder",
            "3 inches vegetable oil (canola/sunflower cooking oil for deep frying)",
            "2 drops food coloring (orange)",
            "1 cup sugar",
            "2 tablespoons rosewater"
        ],
        "recipe": [
            "Gather the ingredients.",

            "Mix the flour, baking powder, yogurt, and food coloring into a batter and keep aside for 24 hours to ferment.",
            
            "Pour batter into a ketchup dispensing bottle.",
            
            "To make sugar syrup, melt the sugar with the rosewater in a small saucepan and boil to get a one thread consistency. To check for one thread consistency, carefully dip the tip of your index finger into the syrup, touch your finger and thumb together and gently tease apart. If one thread is formed between your finger and thumb, the syrup is done.",
            
            "Turn off the fire, add the saffron strands and cardamom and stir well.",
            
            "Heat the oil in a deep wok-like dish. To test for the right temperature, drop a small amount of batter into the oil. If it sizzles and rises to the top of the oil, the oil is hot enough. Keep the flame on medium at all times to ensure thorough cooking of the jalebis.",

            "Now hold the ketchup dispenser over the hot oil and squeeze the batter into the oil into a wiggly, randomly coiled circle. Squeeze out several at a time.",

            "Fry till light golden and then remove and put directly into the sugar syrup.",

            "Allow to soak for 2 to 3 minutes and then remove.",

            "Serve warm"
       
        ]
      }
]