[
  {
     "slug":1,
     "title":"Shahi Falooda, A Traditional Indian Dessert",
     "shortDesc":"Falooda is a popular dessert not only in Mumbai (Bombay) where it is thought to have originated but also in the rest of the country. This chilled drink-dessert is the perfect way to cool off in the summer heat",
     "category":"Dessert",
     "time":"40 min",
     "servings":2,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/Mhgyk99axWOEn6oa2PSxp0HRt9g=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/falooda-indian-dessert-809651654-5abed1b6875db90037976925.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1/2 cup fine rice vermicelli",
        "1/2 cup almonds (blanched and skins removed)",
        "1/2 cup pistachios (shelled and skins removed)",
        "1 glass chilled milk (preferably tall; same glass used for serving)",
        "2 teaspoon sugar (ground to a fine powder)",
        "3 tablespoons basil seeds",
        "6 tablespoons rose syrup",
        "2 scoops ice cream of your choice"
     ],
     "recipe":[
        "Gather the ingredients.",
        "Cook the vermicelli as you would pasta–in boiling water until cooked al dente. Strain and set aside to cool. Then chill in the refrigerator till needed.",
        "Cut into thin slivers a few almonds and pistachios–about 6 to 8 each. Keep aside to use as a garnish later.",
        "Put the milk, powdered sugar, remaining pistachios, and almonds in a blender, and blend until smooth. Chill in the refrigerator.",
        "Put the basil seeds in a bowl and pour enough water over them to completely submerge. They will soon start to swell and look transparent with a small dot-like black center. Strain, and keep aside in a small bowl.",
        "To assemble the shahi falooda, frost two tall glasses. In each glass, put half the vermicelli and half the pre-soaked sabza (basil) seeds. Pour half the milk over them.",
        "Put just under half the rose syrup (keep a little for garnishing) in each glass, and mix well. Add a scoop of ice cream to this, and drizzle with some more rose syrup.",
        "Garnish with slivered almonds and pistachios. Add a straw and long-handled spoon and serve!"
     ]
  },
  {
     "slug":2,
     "title":"Sandesh Mishti-Bengali Dessert",
     "shortDesc":"No Bengali meal is complete without mishti or sweets and none is more loved by the Bengalis than Sandesh. It is surprisingly easy to make. Being a milk-based sweet, Sandesh doesn’t last long so consume it as soon as possible. Given how tasty it is, that shouldn’t be a problem.",
     "category":"Dessert",
     "time":"15 min",
     "servings":"10-12",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/AgYRI0RsZGDZIn3Dj7Rens7ZI9w=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/3244991150_9c7f008761_o-5835aedf5f9b58d5b15308ce.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "14 oz./400 g. fresh paneer (hang to drain whey completely)",
        "10 to 12 almonds (cut into slivers)",
        "8 to 10 of pistachios (cut into slivers)",
        "4 saffron strands (more or less)",
        "1 tbsp. warm milk (to soak saffron)",
        "2 tsp. milk powder",
        "1/2 cup finely powdered sugar",
        "1/2 tsp. pistachio essence",
        "1/2 tsp. cardamom powder",
        "1 tablespoon ghee (to lightly grease molds)"
     ],
     "recipe":[
        "Gather the ingredients.",
        "Soak almond and pistachio slivers and saffron in warm milk. Keep aside to use as a topping. If the nuts do not soak up all the milk by the time you are ready to use them, drain it away before you use the nuts as a topping",
        "Mix the paneer and milk powder in a pan and cook on a medium flame stirring continuously for 3 to 4 minutes.",
        "Allow the mixture to cool.",
        "Add sugar, pistachio essence, and cardamom powder and mix until a smooth dough is formed.",
        "Put a little topping mixture (soaked almonds, pistachios and saffron strands) in each mold.",
        "Chill for a few hours, unmould carefully and serve"
     ]
  },
  {
     "slug":3,
     "title":"Caramel Custard",
     "shortDesc":"This easy-to-make pudding is popular all over India but made especially well by the Parsis, Mangaloreans (both from Western India) and the Anglo-Indians. It can be steamed in a pressure cooker or baked in the oven",
     "category":"Dessert",
     "time":"2 hrs",
     "servings":"4-6",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/lWfbtvVQOJvNQkyB7I1V8aFimNc=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/4247062952_531b892880_o-56a510475f9b58b7d0dabe0a.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "4 cups full cream milk (about 1 liter)",
        "7 eggs",
        "1 cup sugar",
        "1/2 tsp. nutmeg powder",
        "1 tsp. vanilla essence"
     ],
     "recipe":[
        "Gather the ingredients.",
        "Prepare a mold/ pudding cups/ ramekin cups for the custard by greasing very lightly with butter.",
        "Heat 1/2 cup of sugar with 1 tsp of water in a pan till it melts and turns golden brown. Pour this caramelized sugar into the pudding mold/pudding cups/ ramekin cups and swirl to coat the sides of the mold. Keep aside to cool.",
        "If baking, preheat your oven now to 350 F/ 180 C/ Gas Mark 4.",
        "Mix the eggs and remaining sugar together in a large bowl and blend till all the sugar has dissolved. Now add the milk, vanilla essence and nutmeg and blend again.",
        "Pour this mixture into the mold/ pudding cups/ ramekin cups you are using, to fill them 3/4 of the way to the top.",
        "Cook for about 45 minutes or till the custard is firm. Test by inserting a toothpick in the center. If it comes out clean the pudding is done.",
        "When cooked, cool the pudding and then chill in the refrigerator for an hour or two.",
        "To serve, place a plate over the mold/ pudding cup/ ramekin cup, hold firmly in place and turn over gently. The pudding will turn over onto the plate, caramel side up! Pour some of the remaining caramel (if any) over the pudding and serve."
     ]
  },
  {
     "slug":4,
     "title":"Indian Gulab Jamun",
     "shortDesc":"Gulab jamun (or gulaab jamun) is among India's most popular desserts and it's often referred to as Indian doughnuts.This delicious treat consists of soft, melt-in-your-mouth, fried dumplings that are traditionally made of thickened or reduced milk and soaked in rose-flavored sugar syrup",
     "category":"Dessert",
     "time":"50 mins",
     "servings":"4-6",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/XQpLedt8URhtAAqkHXHchHn8IyQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/gulab-jamun-146275796-5835b27c3df78c6f6a855d65.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "6 cups water",
        "3 cups granulated sugar",
        "1 tablespoon cardamom powder",
        "2 tablespoons rose water",
        "3 cups powdered milk",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 cup heavy cream (or double cream, thickened; approximately)",
        "Vegetable, canola, or sunflower oil (for frying)"
     ],
     "recipe":[
        "Gather the ingredients.",
        "In a deep pan, mix the water and sugar and boil until all the sugar is dissolved.",
        "Turn off the heat and add the cardamom powder and rose water. Mix well and set aside.",
        "In a large bowl, mix the powdered milk, flour, and baking powder well.",
        "Add a little of the thickened cream at a time and knead to make a dough that is medium-soft but not sticky. You do not need to use all the cream, just enough to reach the desired consistency; the smoother it is, the better.",
        "Once the dough is ready, divide it into walnut-sized balls and roll between lightly greased palms until smooth. Any cracks that show up get worse later and could lead to the 'milk balls' cracking as they are fried. This is not desirable, so take all the time you need for this step in order to get it right.",
        "While you are making the balls, heat the oil for deep frying in a wide pan on low to medium heat.",
        "Fry the dumplings, stirring often to brown on all sides. Do not cook on very high heat as the dumplings will burn on the outside and remain raw inside.",
        "Once cooked, drain with a slotted spoon while removing the dumplings from the oil and transfer immediately into the rose syrup.",
        "Repeat this until all the dumplings are cooked and in the syrup.",
        "Allow the dumplings to soak in the syrup for at least 2 hours before serving. "
     ]
  },
  {
     "slug":5,
     "title":"Malabi Rose Water Milk Pudding",
     "shortDesc":"The iconic Israeli dessert, known as malabi, has its roots in centuries-old recipes for puddings made of rice flour and almond or cow's milk - which can be found throughout the Middle East, Turkey, and Mediterranean Europe. A close cousin of muhallabia, as the spoon sweet is known in the Arab world, today's Israeli malabi is often made with cornstarch instead of rice flour. Silky textured and light, the flower-scented pudding is topped with sweet syrup and nuts or shredded coconut.",
     "category":"Dessert",
     "time":"15 mins",
     "servings":"6-8",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/hQ3Ezp__H72WJp-6iCRebCyoWr0=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/malabi-rosewater-milk-pudding-4163433-hero-01-2392fd6122b4476eba90be42540a8ac5.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "3 cups whole milk (2% milk is also fine; divided)",
        "1/4 cup cornstarch",
        "1 tablespoon rose water",
        "1/3 cup sugar"
     ],
     "recipe":[
        "Gather the ingredients.",
        "In a small bowl, combine 1/2 cup of the milk with the cornstarch and 1 tablespoon of rose water. Mix well with a fork or clean fingers, until the mixture is smooth and lump-free. (The cornstarch may be hard to stir at first, but will loosen as you mix.) Set aside.",
        "In a medium saucepan, combine the remaining 2 1/2 cups of milk with the sugar. Bring to a boil over medium-high heat, stirring frequently, until the sugar dissolves.",
        "When bubbles begin to break the surface, reduce the heat to low. Give the cornstarch mixture a stir, and add it to the simmering milk, stirring constantly.",
        "Cook the pudding at a gentle simmer, stirring very frequently, until it thickens enough to coat the back of the spoon, about 5 to 7 minutes. (If you're not stirring constantly, try not to scrape the bottom of the pan, or you may end up with lumps in your pudding.)",
        "Pour or spoon the malabi into 6 to 8 serving dishes. Allow to cool slightly, cover with plastic wrap, and refrigerate for at least 3 hours (the pudding will firm up as it cools)."
     ]
  },
  {
     "slug":6,
     "title":"Jalebi - Indian Celebrartion Sweet",
     "shortDesc":"Jalebi is a hot favorite on any special occasion be it a birthday, wedding or festival. Jalebis, though mostly eaten by themselves, can also be soaked in warm milk.",
     "category":"Dessert",
     "time":"115 mins",
     "servings":"4-6",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/_iaTjkl88lorpH96Pc7AtoVhzbQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/jalebi-deep-fried-dessert-1957798-hero-01-871fe89e15d14aa88721406c63d23ee6.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "2 cups flour (self-rising)",
        "1/2 teaspoon baking powder",
        "1 cup yogurt",
        "3 strands saffron",
        "1/4 teaspoon  cardamom powder",
        "3 inches vegetable oil (canola/sunflower cooking oil for deep frying)",
        "2 drops food coloring (orange)",
        "1 cup sugar",
        "2 tablespoons rosewater"
     ],
     "recipe":[
        "Gather the ingredients.",
        "Mix the flour, baking powder, yogurt, and food coloring into a batter and keep aside for 24 hours to ferment.",
        "Pour batter into a ketchup dispensing bottle.",
        "To make sugar syrup, melt the sugar with the rosewater in a small saucepan and boil to get a one thread consistency. To check for one thread consistency, carefully dip the tip of your index finger into the syrup, touch your finger and thumb together and gently tease apart. If one thread is formed between your finger and thumb, the syrup is done.",
        "Turn off the fire, add the saffron strands and cardamom and stir well.",
        "Heat the oil in a deep wok-like dish. To test for the right temperature, drop a small amount of batter into the oil. If it sizzles and rises to the top of the oil, the oil is hot enough. Keep the flame on medium at all times to ensure thorough cooking of the jalebis.",
        "Now hold the ketchup dispenser over the hot oil and squeeze the batter into the oil into a wiggly, randomly coiled circle. Squeeze out several at a time.",
        "Fry till light golden and then remove and put directly into the sugar syrup.",
        "Allow to soak for 2 to 3 minutes and then remove.",
        "Serve warm"
     ]
  },
  {
     "slug":7,
     "title":"Dal Tadka",
     "shortDesc":"A simple and tasty lentil based recipe made with split pea lentil and Indian spices.",
     "category":"Lunch",
     "time":"30 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/ZoJNlSJEPQyi2mS_yrXfpfUDQDs=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/lentils-with-tomato-masoor-dal-3378481-hero-01-b653db32239c4a57bbd21f47d8c1752b.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "FOR PRESSURE COOKING:",
        "1/2 cup Toor dal, rinsed",
        "2 tbsp Masoor dal, rinsed",
        "1/4 tsp turmeric",
        "1/2 tsp salt",
        "1 tsp oil",
        "1.5 cups water",
        "FOR DAL:",
        "2 tbsp ghee / clarified butter",
        "1/2 tsp cumin / jeera",
        "1 bay leaf / tej patta",
        "pinch of hing / asafoetida",
        "2 dried red chilli",
        "2 clove garlic, crushed",
        "1 inch ginger, crushed",
        "1 chilli, slit",
        "1 onion, finely chopped",
        "1/4 tsp turmeric",
        "1/2 tsp Kashmiri red chilli powder",
        "1/2 tsp coriander powder",
        "1/2 tsp salt",
        "1 tomato, finely chopped",
        "2 tbsp coriander, finely chopped",
        "1 tsp Kasuri methi, crushed",
        "1/4 tsp garam masala",
        "FOR TADKA:",
        "1 tsp ghee / clarified butter",
        "1/2 tsp cumin / jeera",
        "pinch of hing / asafoetida",
        "1 dried red chilli",
        "1/4 tsp Kashmiri red chilli powder",
        "1 tsp coriander, finely chopped"
     ],
     "recipe":[
        "Firstly, in a pressure cooker take ½ cup Toor dal, 2 tbsp Masoor dal. You can also add moong dal if you prefer.",
        "Also add ¼ tsp turmeric, ½ tsp salt, 1 tsp oil and 1½ cup water.",
        "Pressure cook for 5 whistles or until dal is cooked well.",
        "Add 1 cup water and adjust consistency. keep aside.",
        "Now in a large kadai heat 2 tbsp ghee and splutter ½ tsp cumin, 1 bay leaf, pinch of hing and 2 dried red chilli.",
        "Also add 2 clove garlic, 1 inch ginger, 1 chilli and saute slightly.",
        "Further add 1 onion and saute until it turns golden brown.",
        "Keeping the flame on low add ¼ tsp turmeric, ½ tsp chilli powder, ½ tsp coriander powder and ½ tsp salt.",
        "Add 1 tomato and saute until it turns soft and mushy.",
        "Add in cooked dal and stir well adjusting consistency as required.",
        "Simmer for 5 minutes or until flavours are well combined.",
        "Now add 2 tbsp coriander, 1 tsp kasuri methi and ¼ tsp garam masala. mix well.",
        "Finally, enjoy dal tadka with jeera rice or steamed rice."
     ]
  },
  {
     "slug":8,
     "title":"Palak Paneer With Ricotta",
     "shortDesc":"This Indian palak paneer with ricotta recipe is vegetarian and all of the ingredients are gluten-free as well.",
     "category":"Lunch",
     "time":"25 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/D3vwudQqfJ6ueOh61agVjmYHdnI=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/spinach-in-a-bowl--sprinkled-with-sheep-s-cheese--india--56109482-5ad74d0343a1030037893a7e.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "2 tbsp. olive oil + 2 tbsp",
        "2 cloves garlic (minced)",
        "1 onion (diced)",
        "1 tbsp. fresh ginger (grated or minced)",
        "2 tsp. cumin",
        "1 tsp. coriander",
        "1/2 tsp. turmeric",
        "1/2 cup sour cream",
        "3 large bunches of spinach",
        "8 ounces fresh whole milk ricotta cheese (drained)",
        "Dash salt (to taste)"   
     ],
     "recipe":[
        "In a large saucepan over medium heat, sauté the garlic and the onion in 2 tablespoons of olive oil for a minute or two.",
        "Add the fresh ginger, cumin, coriander, and turmeric, stirring, and allow the spices to cook for another minute.",
        "Next, reduce the heat to medium-low and add the sour cream, stirring to combine, then the spinach. You may need to add the spinach a little bit at a time, waiting for it to cook down before adding more.",
        "In a separate skillet, using a spoon, scoop out the fresh ricotta into pre-heated oil one spoonful at a time.",
        "Fry the ricotta in 2 tablespoons of olive oil until lightly browned.",
        "Add the fried ricotta cheese to the spinach mixture.",
        "Cover, and cook on medium-low for 5 to 7 more minutes.",
        "Add a dash of salt, to taste, and serve hot."  
     ]
  },
  {
     "slug":9,
     "title":"Ghee Rice",
     "shortDesc":"Ghee rice is a pot rice dish made with ghee, rice, spices and nuts. It is one of the most basic flavored rice recipe served with any curry.",
     "category":"Lunch",
     "time":"20 min",
     "servings":2,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/nLn5U1fErgLWzUV-vVN7OGh0H8g=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Cauliflowerricehoriz-214e8de77ed64914ac686704b40ce9a8.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1 cup basmati rice",
        "2 tbsp ghee / clarified butter",
        "1 medium onion, thinly sliced (optional)",
        "1 3/4 cups water for Indian cooker (1 1/4 cup for Instant pot, 2 cups for normal pot)",
        "1 green chilly (slit or chopped)",
        "1/2 tsp salt (adjust to taste)",
        "14 cashewnuts / kaju",
        "14 raisins",
        "WHOLE SPICES:",
        "2 inch cinnamon / dalchini",
        "4 cloves / laung",
        "3-4 green cardomoms / elaichi",
        "1 strand mace / javitri",
        "1 star anise / chakri phool",
        "1 bay leaf / tej patta"
     ],
     "recipe":[
        "Preparation for ghee rice:",
        "Wash 1 cup rice until the water runs clear.",
        "Soak it for at least 20-30 mins. Drain and set aside.",
        "While the rice soaks, slice 1 medium onion thinly and slit 1 green chilly.",
        "Heat a pressure cooker or a pot with 2 tablespoons of ghee.",
        "Fry 14 cashews till lightly golden, add 14 raisins and stir up.",
        "Whem they turn plump, set them aside in a plate.",
        "To the same pan, add onions. Fry them till golden. These onions are used for garnishing and they add flavor to the rice.",
        "Add all the whole spices to the pan and fry for a min until aromatic.",
        "Add green chillies, drained rice and fry on a medium flame for about 3-4 mins. Stir to prevent burning.",
        "Pour 1 3/4 cups water and salt as needed.",
        "You may need to add more or less water depending on the rice.",
        "Taste the water and check the salt. If needed, add more.",
        "If making in a pressure cooker, allow the cooker to whistle once on a medium flame. If making in pot, cover and cook on a very low flame until the rice is done.",
        "When the pressure releases, gently fluff up the rice with a fork.",
        "Transfer ghee rice to a serving bowl or plate. Garnish with raisins, cashews, frieds onions and coriander leaves.",
        "Serve ghee rice with any gravy like kurma, curry or even with egg roast. You can also eat it plain."
     ]
  },
  {
     "slug":10,
     "title":"Naan (Leavened Indian Flatbread",
     "shortDesc":"There is no Indian bread that is more famous than naan!",
     "category":"Lunch",
     "time":"2hr 15 mins",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/5HVJzZWX_CdUsq1rS8nMSoPzPTQ=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/naan-leavened-indian-flatbread-1957348-final-08-116a2e523f6e4ee693b1a9655784d9b9.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1 1/2 teaspoons dry yeast",
        "1 1/2 teaspoons sugar",
        "1 cup warm water",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "6 tablespoons ghee, divided",
        "3 tablespoons unsweetened yogurt",
        "Vegetable oil, for greasing",
        "3 teaspoons onion seeds"
        
     ],
     "recipe":[
        "Add the dry yeast and sugar to the warm water and stir till the yeast is dissolved. Cover and leave aside for 10 minutes or until the mixture begins to froth. This indicates the yeast is active. Keep aside.",
        "Mix the flour and salt to taste and sift through a very fine sieve into a large mixing bowl.",
        "Next, add the yeast mixture, 3 tablespoons of ghee, and all the yogurt. Use your fingertips to mix all this into a soft dough.",
        "Once mixed, flour a clean, flat surface, and knead the dough till it is smooth and stretchy.",
        "Grease a large bowl with a few drops of vegetable oil and put the dough in it. Cover with cling wrap and allow to rest for about 90 minutes or till the dough doubles in volume.",
        "Lightly flour the same surface on which you kneaded the dough and roll out each ball until you have a circle, 7 to 8 inches in diameter (1/2-inch thick).",
        "Gently pull on one edge of the circle to form the naan into a teardrop shape. Do not pull too hard or you may tear the dough. Instead of rolling the dough out (with a rolling pin) you can also pat it into a circle with your hands.",
        "Preheat your oven 400 F / 200 C / Mark 6.",
        "Lay a piece of aluminum foil ​on an oven tray (to cover) and grease it lightly with a few drops of vegetable oil.",
        "Place as many formed dough balls as will fit without touching each other on the tray.",
        "Brush each dough ball lightly with ghee, and sprinkle a pinch of onion seeds evenly over the surface.",
        "Place the tray in the oven and cook till the naan begins to puff out and lightly brown. Flip the naan and repeat.",
        "Remove from oven and serve hot in a foil-lined basket."
     ]
  },
  {
     "slug":11,
     "title":"Gobi Masala",
     "shortDesc":"Creamy, delicious and lightly spiced cauliflower masala made restaurant style.",
     "category":"Lunch",
     "time":"55 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/E-cLfsMG9rOa0kfZEskdqJ5pzAw=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/cauliflowerpotato-5686d7613df78ccc15009a79.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "For sauteing the cauliflower:",
        "1 medium head cauliflower or gobi",
        "3 tablespoon oil for sauteing the cauliflower",
        "Main ingredients for Gobi masala:",
        "1 medium sized onion, chopped finely",
        "3 to 4 garlic (lahsun) + ½ inch ginger (adrak) - crushed or made into a paste in a mortar-pestle",
        "3 to 4 tablespoon full fat fresh curd (yogurt or dahi) - whipped till smooth (optional) * check notes",
        "¼ teaspoon turmeric powder (haldi)",
        "½ teaspoon red chili powder (lal mirch powder)",
        "½ teaspoon garam masala powder",
        "1 teaspoon coriander powder (dhania powder)",
        "½ teaspoon cumin powder (jeera powder)",
        "1 small tej patta (indian bay leaf)",
        "½ teaspoon caraway seeds (shah jeera)",
        "½ teaspoon crushed kasuri methi (dry fenugreek leaves)",
        "1 to 1.5 cups water - add ½ cup more if required",
        "2 tablespoon low fat cream - 25% to 35% low fat",
        "2 tablespoon oil for the curry",
        "salt as required",
        "To make the paste:",
        "2 medium sized tomatoes",
        "1 tablespoon whole cashews (kaju)"
     ],
     "recipe":[
        "Preparation for gobi masala",
        "Chop the cauliflower into medium florets. Rinse well and keep aside.",
        "Heat 3 cups water with salt till its starts boiling.",
        "Switch off and add the florets in the hot water. Cover and keep aside for 15-20 minutes.",
        "In the meantime, chop the onion and crush the ginger-garlic in a mortar-pestle.",
        "Also grind the tomato-cashews to a smooth paste on a high speed in a blender with very little water. If there is too much water, then the mixture starts spluttering when sauting it.",
        "Keep the tomato-cashew paste aside.",
        "Sauteing gobi for making gobi masala:",
        "Drain the cauliflower florets and keep aside and gently wipe them dry.",
        "Heat oil in a kadai or wok till it starts shimmering.",
        "Add the blanched cauliflower florets to the oil and saute on a low to medium flame till they start getting light brown spots on them.",
        "This takes approx 8 to 10 mins.",
        "Then remove the sauted cauliflower and keep aside.",
        "Making Gobi masala:",
        "In the same pan, add 2 tbsp oil. Add the bay leaf and caraway seeds.",
        "Fry for a few seconds or till the oil become aromatic.",
        "Add the chopped onions and saute till the onions get golden and caramelized.",
        "Then add the ginger-garlic paste and saute for a few seconds till the raw aroma of ginger-garlic goes away.",
        "Add the tomato-cashew paste and stir.",
        "Add the spice powders – coriander, cumin, red chili, garam masala and turmeric.",
        "Saute stirring often till the oil starts to leave the sides of the masala.",
        "The whole masala paste will clump together and you will see oil clearly leaving the sides.",
        "This is an important step as if not done properly, the flavors don't come through in the dish.",
        "Switch off the stove and then add the whisked yogurt.",
        "Stir very well and then add 1 to 1.5 cups water. do add water as required. here I get cauliflower which takes more time to cook. Thus I add more water. If the cauliflower takes less time to cook, then add less water.",
        "If you have fried the cauliflower more than what is mentioned in the recipe, then also you will have to add less water as the cauliflower will be already cooked. So just add enough water to get a medium consistency gravy. Let it come to a boil. Then add the cauliflower and simmer for a minute. ",
        "Stir again and keep the kadai or pan on the fire again.",
        "Now add the sauteed cauliflower florets plus salt.",
        "Stir and cover the kadai or pan with a tight lid.",
        "Cook the cauliflower masala on low to medium flame for approx 10 to 15 minutes or till they are cooked completely.",
        "Keep on checking at intervals.",
        "Lastly add the crushed kasuri methi, cream and a pinch of nutmeg. Stir the gobi curry and switch off the fire.",
        "Serve gobi masala hot with rotis, naan or rice."
     ]
  },
  {
     "slug":12,
     "title":"Tandoori Chicken",
     "shortDesc":"Tandoori chicken is renowned for its vibrant red color, which comes mainly from the spices used.",
     "category":"Lunch",
     "time":"40 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/Y-9WlECF0U7hCAc8yBZBn5kE-nY=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/ChickenTandooriSpruce-f238bf7413984e088268565c5b660b11.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "4 skinless free-range chicken breasts",
        "4 tablespoons lemon juice (freshly squeezed)",
        "1/2 cup full-fat yogurt",
        "2 teaspoons garlic (minced)",
        "2 teaspoons fresh ginger (peeled and minced)",
        "3 teaspoons paprika",
        "2 tablespoons tomato puree",
        "2 tablespoons vegetable oil",
        "1 teaspoon ground cumin",
        "1 tsp Turmeric Powder",
        "Salt to taste",
        "1 teaspoon garam masala"
     ],
     "recipe":[
        "Lay each chicken breast on a chopping board and cut into bite-sized chunks and put into a large, sealable plastic bag.",
        "Put all the ingredients for the marinade into a food processor or blender and process until a thick, smooth paste is created. If you are using fresh spices, the paprika will have turned the marinade a lovely red color; if you feel this is not strong enough, then add the drops of food coloring. ",
        "Pour the marinade into the plastic bag with the chicken, seal the bag, and gently massage the bag to make sure all the chicken pieces are coated. Put the bag into a bowl and into the fridge overnight if possible but at least 6 hours.",
        "Remove the bag with the chicken from the fridge for 20 minutes to help it come up to room temperature, if you cook the chicken straight from the refrigerator it will take longer to cook through, and the chicken meat will be tough",
        "Preheat the oven to 360 F.",
        "Place the chicken into a heavy, ovenproof dish. Place in the middle of the oven and cook for 20 minutes if previously seared in a griddle pan or 25 minutes if not. Remove the dish from the oven and put to one side for 5 minutes to allow the chicken to rest. ",
        "Serve the chicken hot, sprinkled with the garam masala over cooked basmati rice with fresh coriander leaves and lemon wedges on the side to squeeze over the chicken."
     ]
  },
  {
     "slug":13,
     "title":"Egg Curry (Andey Ki Curry)",
     "shortDesc":"Egg curry ranks high on the list of comfort foods.",
     "category":"Lunch",
     "time":"40 min",
     "servings":"2-3",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/E3KUdOBM3NEQNVwuOugWqh9PXJ8=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-1064616852-cd54f73689da45ed91f68d63035c3c86.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "6 hard-boiled eggs",
        "5 tbsp. cooking oil (vegetable, canola, or sunflower)",
        "2 medium-sized onion (cut into quarters)",
        "3 medium-sized tomatoes (cut into quarters)",
        "2 green chilies",
        "2 tsp. garlic paste",
        "2 tsp. ginger paste",
        "2 tsp. coriander powder",
        "1 tsp. cumin powder",
        "1 tsp. garam masala powder",
        "1/2 tsp. turmeric powder",
        "1/2 tsp. red chili powder",
        "Salt to taste"
       
     ],
     "recipe":[
      
      "Heat the remaining oil in the same pan and add the paste you just made. Fry for 2 to 3 minutes.",

      "Add the ginger and garlic pastes, all the dry spices (coriander powder, cumin powder, garam masala powder, turmeric powder, and red chili powder) then mix and fry till the oil begins to separate from the masala (onion-tomato-spice mix).",

      "Add 1 tomato and saute until it turns soft and mushy.",

      "Add finely chopped onions and cook for 2-3 minutes till translucent.",

      "Add 1 tsp cumin seeds. Let them splutter.",

      "Turn off the fire and garnish with chopped coriander leaves and the slit green chilies (if using). Serve hot with plain boiled Basmati rice and a vegetable side dish."
     ]
  },
  {
     "slug":14,
     "title":"Pongal",
     "shortDesc":"Pongal is a popular south indian dish. Prepared with rice & moong dal, it is offered to the gods during festivals or auspicious times.",
     "category":"Breakfast",
     "time":"20 min",
     "servings":"2",
     "img":{
        "url":"https://files2.hungryforever.com/wp-content/uploads/2018/03/18154126/kuthiraivali-pongal-recipe.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1/2 cup rice",
        "1/4 cup moong dal",
        "1/2 teaspoon cumin seeds - lightly crushed",
        "4 saffron strands (more or less)",
        "1/8 teaspoon asafoetida (hing)",
        "1 inch ginger - chopped",
        "3 to 3.25 cups water or add as required",
        "salt as required",
        "1 teaspoon cumin seeds",
        "1 teaspoon black pepper, whole or crushed",
        "1 sprig curry leaves or 10 to 12 small to medium curry leaves",
        "10 to 12 cashews - whole or halved",
        "2 to 3 tablespoon ghee (clarified butter)"
     ],
     "recipe":[
        "Pick ¼ cup of moong dal first to get rid of stones if any. Then heat a small pan or a small kadai and add the moong lentils.",
        "On a low flame stirring often roast the moong lentils till they become aromatic.",
        "The moong lentils only need to be roasted till they become aromatic. No need to brown them.",
        "Now take them in another bowl or you can use the same pan for rinsing.",
        "Add ½ cup rice in the bowl containing the roasted moong dal",
        "Rinse both rice and roasted moong dal a couple of times with water",
        "Drain very well and then add them in a pressure cooker",
        "Now add the following ingredients - ½ tsp cumin seeds, ⅛ tsp asafeotida/hing, 1 tsp heaped chopped ginger. Also add salt as per taste.",
        "Pour 3 to 3.25 cups water. The amount of water to be added depends on the consistency you want and also on the quality of moong dal.",
        "Pressure cook on a medium to high flame for 7 to 8 whistles or 11 to 12 minutes.",
        "Let the pressure settle down on its own and then you remove the lid to check the doneness and consistency. If the pongal has a consistency like that of pulao, then add ½ to 1 cup hot water and mix very well.",
        "Both the rice and the moong dal should be cooked very well. If you want you can even slightly mash the cooked rice and moong lentils. If cooked well, then cover with the lid and keep aside.",
        "In another small pan, heat 2 to 3 tbsp ghee. 3 tbsp ghee gives a good taste and flavor.",
        "Add 1 tsp cumin seeds. Let them splutter.",
        "Then add 10 to 12 cashews. fry till the cashews become light golden.",
        "Once they begin to get light golden, then add 1 tsp black pepper and 10 to 12 curry leaves.",
        "Stir very well and fry till the curry leaves become crisp. The black pepper should also be fried well.",
        "Now pour this entire tempering on the pongal. mix very well.",
        "Cover with the lid (with the vent weight/whistle on the lid) and keep ven pongal aside for 5 to 6 minutes. This allows the tempering flavors to infuse with the pongal and the aroma to stay in.",
        "Then remove the lid and serve hot with coconut chutney or sambar."
     ]
  },
  {
     "slug":15,
     "title":"Kharabath",
     "shortDesc":"Kharabath is a basic & delicious south indian breakfast made with semolina, spices, herbs & veggies.",
     "category":"Breakfast",
     "time":"20 min",
     "servings":"2",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/892HqmPdGvzwnCYZUYH0o6mljIU=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/upma-breakfast-dish-1957774-hero-5c3f668046e0fb0001d1b8dd.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        " 1 1/2 cup sooji (upma rava/semolina)",
        " 1 onion, medium size, finely chopped",
        " 3 green chilies , slit length wise",
        " 1/2 tbsp ginger, grated",
        " 1 carrot , small, peeled and finely chopped",
        " 1/4 cup green peas",
        " 1 tomato, very small, finely chopped (optional)",
        " 2 tbsps fresh coriander , chopped",
        " 1 tbsp lemon",
        " 2 tbsp grated fresh coconut",
        " 8-10 cashew nuts",
        " 1/4 tsp turmeric powder",
        " 1 sprig curry leaves ",
        " Salt to taste",
        " 1/2 tsp Mustard seeds ",
        " 1 tsp Split urad dal",
        " 8-10 Cashew nuts, break into small pieces",
        " pinch of asafoetida",
        " 3/4 tsp chana dal",
        " 1/4 tsp urad dal",
        " 3/4 tsp coriander seeds",
        " 2 dry red chili ",
        " small pinch of jeera",
        " 1/4 cinnamon ",
        " 3 tbsps oil",
        " 3 tbsps Ghee"
     ],
     "recipe":[
        "Heat a heavy bottomed vessel and add the semolina and reduce flame. Roast the sooji over low flame for 5-6 mins. It should not be roasted over a medium or high flame. Constantly mix the semolina while roasting it. Remove to a plate and set aside.",
        "In the same vessel, add 2 tbsp ghee and 3 tbsp oil. Once hot, add mustard seeds and allow to splutter. Add urad dal and allow the dal to turn light red, Add the cashew nuts and allow to turn a light golden brown, Add asafoetida, curry leaves and green chilies and mix.",
        "Add the chopped onions and saute for 3 mins. Add grated ginger, carrots, and capsicum and saute for 5 mins over low flame. Add salt, turmeric powder, and the ground khara bath powder and mix.",
        "Add the chopped tomatoes, and chopped coriander leaves and cook for 2 mins. Add the green peas and mix. Add 4 1/2 cups of water, place lid and bring to a boil. Remove lid and continue to boil for 3 more mins.",
        "Reduce flame to low, using your left hand slowly add the roasted semolina into the simmering water while constantly mixing the contents of the vessel with your right hand. You will need to use some muscle power here to thoroughly mix it without any lumps.",
        "Place lid and cook for 5 mins on low flame. Add a tbsp of ghee and lemon juice and mix well again. Turn off flame and remove to a serving bowl.",
        "Garnish with fresh coriander leaves and freshly grated coconut.",
        " Serve with coconut chutney or peanut chutney."
     ]
  },
  {
     "slug":16,
     "title":"Mix veg paratha",
     "shortDesc":"Mix veg paratha is a healthy & kids friendly dish. They taste delicious & super soft. They can be eaten on their own or with raitha-pickle",
     "category":"Breakfast",
     "time":"40 min",
     "servings":"7 parathas",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/H54K8LhRRqk_q81j8ds9HgEqBIU=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/indian-breakfast-in-goa-511910426-584ece7f3df78c491ee72616.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "2 and a 1/2 cup wheat flour ",
        "1/2 tsp salt ",
        "3 tsp oil ",
        "water to knead ",
        "2 potato, peel & cube ",
        "1 carrot, chopped ",
        "20 florets of cauliflower ",
        "15 beans, chopped ",
        "1/2 cup peas ",
        "1/2 tsp salt ",
        "2 tsp oil ",
        "1/2 tsp ginger paste ",
        "2 chilli, finely chopped ",
        "1/2 tsp garam masala",
        "1/2 tsp cumin powder",
        "1/2 tsp aamchur / dry mango powder",
        "1/2 tsp coriander seeds, crushed",
        "¼ tsp carom seeds",
        "1 pinch of asafoetida",
        "1 cup cottage cheese, grated",
        "2 tbsp coriander, finely chopped"
     ],
     "recipe":[
        "firstly, in a large bowl take 2½ cup wheat flour, ½ tsp salt and 2 tsp oil. mix well. Then add 1 cup water and knead a dough.",
        "knead to smooth and soft dough adding water as required.",
        "now grease 1 tsp oil, cover and rest for 20 minutes.",
        "For the stuffing : ",
        "firstly in a pressure cook take 2 cup water and place a vessel. Add 2 potato, 1 carrot, 20 florets gobi, 15 beans, ½ cup peas and ½ tsp salt.",
        "cover and pressure cook for 4 whistles without adding any water to the vessel.",
        "drain off the vegetables to remove any water if present. Now mash the vegetables with the help of a fork.",
        "make a smooth vegetable mix & keep it aside",
        "now in a large pan heat 2 tsp oil and saute ½ tsp ginger paste and 1 chilli. further keeping the flame on low add ½ tsp garam masala, ½ tsp cumin powder, ½ tsp mango powder, ½ tsp coriander seeds, ¼ tsp carom and pinch asafoetida.",
        "saute on low flame until spices turn aromatic. now add 1 cup grated paneer and saute for 2 minutes. further, add mashed vegetables, ¼ tsp salt and saute for 5 minutes.",
        "cook until the mixture loses its moisture and separates pan.turn off the flame and add 2 tbsp coriander leaves, mix well and allow to cool completely.",
        "To make the parathas, pinch a ball sized wheat dough and dust with some wheat flour. further, roll it in a circle of about 5 to 5.5 inches in diameter.",
        "place a ball sized prepared mix veg stuffing in the centre. take the edge and start pleating bringing to the centre.also join the pleats together and secure tight pinching off excess dough.",
        "sprinkle some wheat flour and roll slightly thick.",
        "on a hot pan place the rolled paratha and cook for a minute. flip the paratha when the base is partly cooked (after a minute).",
        "brush oil / ghee and press slightly. flip again once or twice till both the sides are cooked properly.",
        "finally, serve hot mix vegetable paratha with sauce, raita or pickle."
     ]
  },
  {
     "slug":17,
     "title":"Akki rotti ",
     "shortDesc":"Akki means rice & rotti means flatbread. It is an everyday food from south indian cuisine (North karnataka)",
     "category":"Breakfast",
     "time":"15 min",
     "servings":"6 rottis",
     "img":{
        "url":"http://foodandremedy.com/wp-content/uploads/2016/12/Akki-Rotti-3-768x512.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1 cup rice flour",
        "1 onion, finely chopped",
        "½ carrot, gratted",
        "1 inch ginger, finely chopped",
        "1 green chilli, finely chopped",
        "few coriander leaves, finely chopped",
        "1 tsp cumin seeds ",
        "salt to taste",
        "oil for roasting",
        "water as required "
     ],
     "recipe":[
        "firstly, in a large mixing bowl, combine rice flour, carrot, onion, coriander leaves, chilli, ginger, salt and cumin seeds.",
        "furthermore, crumble the above mixture well. add in required water to make a soft dough.",
        "additionally, add more water if required. and make smooth and soft dough.",
        "now take a small ball of dough and start patting over oiled aluminum foil or banana leaf.",
        "pat as thinly as possible. dip your hand in water so that you can spread easily and avoid from having cracks.",
        "make few holes while patting the rotii so that your rotti can absorb oil and cook fast.",
        "grease the tava with oil and gently drop the sheet upside down over the hot griddle.",
        "after a minute, peal off the aluminium sheet slowly without breaking your akki rotti.",
        "smear some oil over the rotti and cook on medium flame. flip over and cook both sides.",
        "finally, serve the roti hot with chutney of your choice."
     ]
  },
  {
     "slug":18,
     "title":"Masala Dosa",
     "shortDesc":"Dosa is a thin crispy crepe made using fermented rice and lentil batter. Masala dosa has spiced potato and seasoned stuffed in it",
     "category":"Breakfast",
     "time":"30 min",
     "servings":"10 dosas",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/gwpiDc5y98oumhsMNd2hw7zYn3o=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/how-to-make-dosa-1957716-Hero-5b59e84346e0fb0071e637c5.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1 and a 1/2 cups parboiled rice",
        "1/2 cup urad dal or husked whole split black gram",
        " 1/4 cup thick poha (flattened rice)",
        "0.5 tablespoon chana dal (husked & split bengal gram)",
        "10 fenugreek seeds",
        "0.5 cup water for soaking urad dal ",
        "1 cup water for soaking rice",
        "1/2 cup water for grinding rice & poha",
        "1/4 cup water for grinding dal",
        "1/4 teaspoon rock salt or add as required",
        "2 cups boiled & chopped or crumbled potatoes",
        "1 tablespoons oil",
        "1/4 teaspoon mustard seeds",
        "1/2 tablespoon chana dal (husked & split bengal gram) soaked in ¼ cup hot water for 30 minutes",
        "1 and a 1/4 cups thinly sliced onions",
        "1 teaspoon finely chopped ginger",
        "4 to 5 curry leaves",
        "4 green chillies, chopped",
        "pinch of turmeric powder",
        "pinch of asafoetida",
        "1/4 cup water",
        "1 and a 1/2 tablespoons chopped coriander leaves",
        "salt as required"
     ],
     "recipe":[
        "Rinse the urad dal, chana dal and methi seeds a couple of times. Then soak them in 1 cup water for 4 to 5 hours.",
        "Rinse the rice a couple of times and keep aside.",
        "Rinse the flattened rice once or twice and then add to the rice.",
        "Pour 2 cups water. Stir and soak both rice and poha together for 4 to 5 hours.",
        "Making the batter : Before grinding, strain the water from the soaked lentils and keep it for grinding urad dal. ",
        "Add the lentils in the grinder jar. Also add ½ cup of the soaked and strained water to the dal. You can even use fresh water while grinding.",
        "Grind the urad dal, chana dal and methi seeds till you get a batter which is light and fluffy. The urad dal has to be ground really well, so that the batter ferments well.",
        "shift the batter to a bowl with a spatula.",
        "Strain the rice well. Then in the same grinder, add the soaked rice and 1 cup fresh water. You can grind rice in one batch or in two to three batches. This will depend on the size of the grinder jar. I ground in one batch and added 1 cup water for grinding. You can even add ¾ cup water while grinding. Addition of water will depend on the quality of rice.",
        "Grind the rice till you get a fine grainy consistency in it. The rice batter should have a fine rawa like consistency. You can even grind to a smooth batter. ",
        "Now pour the batter in the same pan or bowl containing the urad dal batter.",
        "Add ½ teaspoon rock salt or add as per taste.",
        "Mix the salt very well with the batter. Also mix both the batters very well. Cover and keep aside to ferment for 8 to 9 hours. You can keep batter to ferment for less or more time and this will depend on the temperature conditions in your city.",
        "cooking potatoes : First rinse and then boil 4 medium sized potatoes in 2 cups water for 5 to 6 whistles in a pressure cooker. You can also boil potatoes in a pan. The potatoes have to be completely cooked",
        "When the potaoes are cooking, soak the chana dal in hot water for 30 minutes. Then drain the chana dal and keep aside.",
        "When the pressure settles down on its own in the cooker, remove the lid. Drain the potatoes and let them become warm. then peel them and chop them.",
        "Also slice the onions thinly and chop the green chilies, ginger and coriander leaves.",
        "Heat oil or ghee. Lower the flame and add mustard seeds and let them splutter. Then add the chana dal.",
        "Saute the chana dal for 2 to 3 minutes on a low flame or till they turn light golden or golden. Now add the sliced onions, curry leaves, green chilies and ginger.",
        "Saute the onions till they soften and turn translucent.",
        "Add the turmeric powder and asafoetida. Mix very well.",
        "Add water. mix well and simmer for 2 to 3 minutes or till the mixture thickens a bit.",
        "Next add the boiled chopped potatoes and mix very well.",
        "Season with salt. Also add ¼ teaspoon sugar for a slight sweet taste.",
        "Simmer on a low flame for 3 to 4 minutes stirring occasionally. The water will reduce and the potato masala will thicken.",
        "Switch off the flame and then add chopped coriander leaves. Also add the fried cashews now and mix well. The potato masala should be moist and easily spreadable on the dosa. Make sure there is no water in the potato masala. It should not be of a curry or gravy consistency.",
        "Stir and keep the potato masala aside. ",
        "Now we have everything we need to make the dosas. Lightly stir the batter, before you begin to make dosa. You will also see tiny air pockets in the batter",
        "Heat a cast iron pan or a flat non-stick pan. The pan should be medium hot. Smear some oil if using an iron pan or griddle. Don't smear oil on a non stick pan, as then you won't be able to spread the dosa batter.",
        "Keep the flame to a low, while spreading dosa batter.",
        "Spread the dosa batter in a circular way on the pan.",
        "On a medium flame, cook the dosa. Sprinkle some oil on top and edges. Cover the dosa with a lid and let it cook.",
        "Cook the dosa till its base becomes golden and crisp.",
        "When the base turns golden in color, place a portion of the potato masala on the dosa. ",
        "Now fold the dosa and serve with coconut chutney."
     ]
  },
  {
     "slug":19,
     "title":"Poha ",
     "shortDesc":" Poha is a quick breakfast & snack recipe. MAde with flattened rice, groundnuts & spices. Its prepared in a similar way all across India",
     "category":"Breakfast",
     "time":"10 min",
     "servings":"4",
     "img":{
        "url":"https://www.thespruceeats.com/thmb/4Ud1lZRamATvEvFaWkLn-Ht95z8=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/poha-flattened-rice-1957769.Hero-5b5f0bd246e0fb0050ab3cfb.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "2 cups flattened rice",
        "1 potato cubed in medium size pieces",
        "1 big onion chopped finely",
        "1/2 cup peas",
        "1/2 tsp sugar (any kind) optional",
        "1 tsp salt or to taste",
        "1/2 lemon (juice extracted)",
        "2 tsp coconut oil (or oil of choice)",
        "1 tsp mustard seeds",
        "2 to 3 green chillies (use as per spice levels)",
        "6 to 7 curry leaves",
        "1/2 tsp turmeric powder",
        "1 tbsp finely chopped coriander leaves",
        "2 tbsp crushed or whole roasted peanuts"
     ],
     "recipe":[
        "Take the poha in a colander and wash it in running water for a minute and not more than that. Drain and set it aside.",
        "In a pan pour the oil and wait for it to heat up. Then add the mustard seeds, chillies, curry leaves & turmeric powder",
        "When the mustard seeds splutter, add the onions and saute for a minute. (No need to brown the onions).",
        "Add the potatoes, peas, 1 tbsp water, salt. Close the lid, cook for 2 minutes.",
        "Then add the washed flattened rice (poha). Mix and close the lid again and let it rest for 10 minutes or more. ",
        "The poha will get cooked in the retained heat. After 10 minutes, open up and add some lemon juice and sugar. Adjust salt as need at this stage.",
        "Garnish with coriander leaves and peanuts. Serve your poha hot."
     ]
  },
  {
     "slug":20,
     "title":"Dum Aloo",
     "shortDesc":"Fried potatoes simmered in a spicy and savory tomato-cashew sauce infused with delicious, aromatic Indian spices",
     "category":"Dinner",
     "time":"30 min",
     "servings":4,
     "img":{
        "url":"https://www.whiskaffair.com/wp-content/uploads/2016/08/Kashmiri-Dum-Aloo-4.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "FOR PRESSURE COOKING:",
        "12 baby potatoes (or large potatoes cut into small pieces)",
        "2 tablespoons and 1 teaspoon of vegetable oil, divided",
        "12 whole cashews, soaked in water for 30 minutes",
        "1/2 teaspoon fennel seeds",
        "2.5 cm (1 inch) piece of cinnamon",
        "2 green cardamom pods",
        "1 bay leaf",
        "2 cloves",
        "1 medium onion, chopped",
        "1 1/4 cm (1/2 inch) piece of ginger, chopped",
        "2 cloves of garlic, chopped",
        "2 spicy green chilies, chopped (adjust to taste)",
        "2 tomatoes, chopped",
        "1 teaspoon cumin seeds",
        "1 1/2 teaspoons chili powder",
        "2 teaspoons coriander powder",
        "1/4 teaspoon turmeric powder",
        "Salt, to taste",
        "1 cup water",
        "Fresh cilantro, to garnish"
     ],
     "recipe":[
        "Bring a medium-sized pot of water to a boil and boil the potatoes until tender but not mushy. Drain the potatoes and allow them to cool. Peel them once cool enough to handle. While to potatoes are cooking, puree the soaked cashews with a bit of water in a food processor to a thick paste.",
        "Heat one teaspoon of oil in a large pan over medium heat. Fry the potatoes until lightly browned and crispy on all sides. Set aside on a paper towel to drain.",
        "Add one tablespoon of oil to the pan and allow it to heat on high. Once the oil shimmers, reduce the heat to medium and add the fennel seeds. Fry just until the seeds crackle and darken slightly and then add in the cinnamon, cardamom, bay leaf, and cloves. Continue frying for just a few seconds until they release their aromas.",
        "Add the onion, garlic, ginger, and green chili to the spices and cook until translucent. Add the tomatoes and cook until soft. Remove the pan from the heat and allow to cool. Once cool, puree in a food processor or blender.",
        "Heat one tablespoon of oil in your pan over high heat. Once shimmering, reduce the heat to medium and add in the cumin seeds. Fry until they begin to crackle and then add in the onion-tomato puree. Cook, stirring occasionally, until the liquid has evaporated and it forms a thick paste.",
        "Add in the dry spices: chili powder, coriander, turmeric, and a pinch of salt. Allow to cook for a minute, then stir through the cashew paste",
        "Finally, add the water and bring to a boil.",
        "Poke the potatoes all over with a fork to allow the sauce to penetrate and add them to the pan.",
        " Simmer for 5 minutes or until the gravy has reached your desired consistency.",
        "Serve garnished with chopped fresh cilantro leaves."
     ]
  },
  {
     "slug":21,
     "title":"Yakhni Pulao",
     "shortDesc":"This tasty rice pilaf dish is a classic at North Indian meals where it is known as a\n pulao. It gets its modifier—yakhni (pronounced akhni)—from the meat stock it is\n cooked in",
     "category":"Dinner",
     "time":"120 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/q8zqe7qewAgnKWL6k4UmkCrcnNA=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-670907143-59636adb3df78cdc68bb8033.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "2 pounds/1 kilogram goat meat or lamb with bones",
        "2 tablespoons garlic paste",
        "2 tablespoons ginger paste",
        "3 tablespoons neutral oil (vegetable, sunflower or canola)",
        "4 large onions (2 chopped fine, 2 sliced very thinly)",
        "2 1/2 cups basmati rice (washed well)",
        "3 tablespoons unsweetened yogurt",
        "Salt to taste"
     ],
     "recipe":[
        "If you are using a pressure cooker, put 6 cups of water in it. If using a deep, heavy-bottomed pan, put 8 to 9 cups of water in it.",
        "Cut a piece of muslin cloth into a 6-inch square and place the cinnamon, black and green cardamom, cloves, peppercorns, star anise, coriander and cumin seeds, bay leaf and red chili powder in the center of this square.",
        "Gather up the edges and tie tightly with a piece of string to form a bundle. Put this bundle in the pressure cooker or pan.",
        "Add the ginger, garlic pastes, meat, and salt to taste to the pressure cooker or pan and close. Boil till the meat is almost cooked.",
        "Remove the muslin bag and throw it away. Remove the meat from the pot and reserve. The stock left in the pot should measure 6 cups. If there is more, boil it down till you get 6 cups. If there is less, add hot water to get 6 cups.",
        "Now add the reserved meat, reduced stock, rinse rice and yogurt, and mix well. Cook on medium till the mixture comes to a boil. Reduce the heat and simmer, covered, until the rice is done. The rice is done when you press a few grains between your index finger and thumb and they feel firm but mash completely (just like al dente pasta).",
        "Open the pan and stir the rice well, taking care not to break up the pieces of meat.",
        "Garnish with optional fried sliced onions and serve it piping hot with a vegetable raita or curry dish of your choice."
     ]
  },
  {
     "slug":22,
     "title":"Rajma Masala",
     "shortDesc":"Delicious and flavourfull curry made with red kidney beans aka rajma.",
     "category":"Dinner",
     "time":"40 mins",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/6bx14Fc3YR4YZMlVRisCxzPwInM=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/dv2093017-56a8bb4b3df78cf772a028b9.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1.25 cups rajma, soaked in enough water overnight or use 3 cups canned kidney beans",
        "4.5 cups + ½ cup water, ½ cup to be added later on",
        "2 tablespoons oil",
        "2 bay leaves",
        "2-3 green cardamom pods",
        "3 black cardamom",
        "1-2 cinnamon stick",
        "2 onion, finely chopped",
        "1.5 tablespoons ginger-garlic paste",
        "4 tomatoes, made into a puree",
        "½ teaspoon cumin powder",
        "½ teaspoon coriander powder",
        "¼ teaspoon red chili powder, or to taste",
        "2 teaspoons rajma masala powder",
        "salt, to taste"
     ],
     "recipe":[
        "Preparation for Rajma Masala:",
        "In a large bowl soak 1.25 cups of rajma (kidney beans) in enough water for 6-8 hours, preferably overnight.",
        "In a pressure cooker add the rajma, 4.5 cups water, turmeric, salt and 2 tea bags [if using]. Stir and cook on high for 1-2 whistle, then set the heat to medium and cook for another 10-15 minutes.",
        "The rajma is done when you can easily press it between your fingers. Remove the tea bags and set aside.",
        "Heat 2 tablespoons of oil in a pan on medium heat, once the oil is hot add bay leaves, cardamom pods, cinnamon stick and black cardamom.",
        "Saute for a minute.Add finely chopped onions and cook for 2-3 minutes till translucent.",
        "Add finely chopped onions and cook for 2-3 minutes till translucent.",
        "Add ginger-garlic paste and cook till raw smell goes away. This will take 3-4 minutes.",
        "Once the ginger-garlic is done, add the fresh tomato puree and mix.",
        "Cover the pan and let it cook for 10 minutes on medium heat. Stir once or twice in between.",
        "After 10-12 minutes, the tomatoes are done when there's no raw smell.",
        "Add the dry spices - cumin powder, rajma masala coriander powder and red chilli powder. Also add the salt and mix.",
        "Cook the spices for 2 minutes or till oil starts oozing from the sides.",
        "Add the cooked rajma and mix.",
        "Add water to the curry [the same water which we used to boil the rajma]. You can add 1/2 cup more water here.",
        "Cover the pan and cook the rajma curry for 20 minutes on medium-low heat.",
        "After 20 minutes, the curry will thicken, you can adjust the consistency to preference. Switch off the flame.",
        "In a small pan, heat 1 tablespoon of ghee or oil. Once hot add ginger julienne and chopped green chilli.",
        "Saute for 1-2 minutes till they turn light brown in color.",
        "Transfer tempering to the rajma masala. Also add chopped coriander leaves, crushed kasuri methi (dried fenugreek leaves), garam masala and mix.",
        "Serve hot with rice or any Indian bread."
     ]
  },
  {
     "slug":23,
     "title":"Coconut Vegetarian Korma",
     "shortDesc":"It's naturally paleo and gluten-free and can easily be made vegan. Serve it with a side of rice, quinoa or cauliflower rice for a quick and delicious dinner.",
     "category":"Dinner",
     "time":"40 min",
     "servings":2,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/vVeufuiT9WRw75eqLvY9srVh2-E=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/indian-coconut-curried-vegetables-3377804-hero-01-e43bac5abf16453490d62e310ca1490e.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        " Preparation for the Vegetable Korma Sauce",
        "1 tablespoon oil",
        "1 large onion, chopped",
        "1 2-inch piece of ginger, peeled and chopped",
        "4 garlic cloves, smashed with the back of a knife",
        "1 5.5-ounce can of tomato paste",
        "1 tablespoon each: curry powder and garam masala",
        "1 1/2 teaspoons each: cumin, coriander, turmeric, cardamom",
        "1–2 teaspoons sea salt",
        "1/2 teaspoon each: ground cloves, fennel, fenugreek and chili flakes",
        "1 400ml can of coconut milk",
        "1/2 cup cashews",
        "2 tablespoons lemon juice",
        "1/2 cup yogurt (omit or use vegan yogurt for vegan)",
        "1 tablespoon brown sugar (sub coconut sugar or honey for paleo)",
        "Top with any or all: cashews, cilantro, lemon, and raisins"
     ],
     "recipe":[
        "Add the potatoes to a medium-sized pot, cover with water and bring to a boil.",
        "Let the potatoes boil for 5 minutes then add the rest of the veggies to the pot. Let them boil for another 5 minutes then drain the pot and set it aside.",
        "While the veggies are cooking, start preparing the vegetarian korma sauce. Heat the oil in a medium-sized pot over medium-high heat.",
        "Add the onion and cook, stirring occasionally, until it is soft, about 5 minutes. Add the ginger and garlic and cook for 2 minutes more.",
        "Remove the pot from the heat and add the tomato paste and all of the spices.",
        "Stir well then return the pot to the heat.",
        " When the spices are fragrant and the tomato paste caramelized, after about 1 minute, add the coconut milk, cashews, lemon juice and 1 1/4 cups of water.",
        "Let the pot boil for 5 minutes to soften the cashews.",
        "Working in batches, blend the curry until it is smooth then add it back to the pot.",
        "Stir through the yogurt and brown sugar and add more sea salt, if needed.",
        "Stir the veggies into the curry and serve immediately topped with any or all of the toppings."
     ]
  },
  {
     "slug":24,
     "title":"Prawn Biryani",
     "shortDesc":"Rice, Prawns & Exotic Spices… layered with Caramelized Onions, Saffron and Fresh Herbs… Mouth Watering and Delicious!",
     "category":"Dinner",
     "time":"1 Hour",
     "servings":5,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/LjRrH9oFj7xSqL6yyVvS2qb9FFw=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/GettyImages-639704020-5c4a63ecc9e77c00017bfebf.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "For marinating Prawns",
        "2 cups prawns",
        "1 tbsp chili powder",
        "½ tsp turmeric powder",
        "1 tbsp coriander powder",
        "½ tsp pepper powder",
        "1 tsp garam masala",
        "For preparing Prawn Masala",
        "2 medium onions (sliced)",
        "1 small piece of ginger",
        "4 garlic cloves",
        "4 green chilies",
        "1 tomato (chopped)",
        "3 tbsp yogurt",
        "¼ tsp pepper powder",
        "½ tsp chili powder",
        "1 tsp garam masala",
        "Mint & cilantro leaves (chopped)",
        "Oil (as required)",
        "Salt (as required)",
        "1 tbsp butter/ghee"
     ],
     "recipe":[
        "Preparation for Prawn Biryani",
        "Clean, peel and devein prawns.",
        "Mix the ingredients of the marinade properly, add salt as needed.",
        "Marinate the cleaned prawns and keep aside for 30 mins.",
        "Wash and soak rice for 30 minutes and drain the water completely.",
        "Heat ghee in a skillet; add cardamoms, cinnamon, clove, star anise, pepper corns, bay leaf, and saute until fragrant.",
        "Add the drained rice with a little salt and stir continuously for 2 minutes. When the rice starts crackling, pour water, lemon juice and cook till water is completely absorbed. Fluff it up using a fork and keep it aside.",
        "Heat oil in a pan, shallow fry the marinated prawns on both sides. Remove from the pan and keep aside.",
        "Into the same pan, add sliced onions, saute until they are translucent.",
        "In the meantime, grind ginger, garlic and green chilies to a thick paste.",
        "Add the green paste to the pan and saute for 2 minutes.",
        "Add chopped tomato and place the lid, cook for 2 minutes until it turns mushy.",
        "Add pepper powder, chili powder and garam masala, stir well. Followed by adding chopped mint and cilantro leaves.",
        "Add whisked yogurt, prawns, and mix well with the masala, check for seasonings.",
        "Prawn masala is ready.",
        "Heat ghee/butter in a pan. Fry the sliced onions until they are golden brown. Keep it aside.",
        "Into the same pan, fry cashews and raisins until they are golden. Keep aside.",
        "Warm milk in a small bowl and mix the saffron strands, allow it to stand for 2 minutes.",
        "For layering, into a heavy bottomed pan add a half of all the prepared ingredients as detailed below. The remaining half is to be repeated later as instructed.",
        "Start with spreading the prepared masala first, evenly covering the bottom of the pan.",
        "Follow by spreading rice on top of it. Sprinkle cashews, raisins, fried onions, saffron milk, and cilantro mint leaves.",
        "Repeat the process of steps 5 & 6 with the second half of the ingredients.",
        "Cover the pan with the lid and cook the biriyani on low flame for 10 minutes.",
        "Serve warm with pappad, salad and pickles."
     ]
  },
  {
     "slug":25,
     "title":"Chicken Tikka Masala",
     "shortDesc":"Aromatic, spiced and a delicious Chicken Tikka Masala.",
     "category":"Dinner",
     "time":"40 min",
     "servings":4,
     "img":{
        "url":"https://www.thespruceeats.com/thmb/jbN3FZDnSOqh9NdsCnBXO1h2bC4=/960x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/instant-pot-tikka-masala-recipe-4589222-final-5c8feea2c9e77c0001eb1c8e.jpg",
        "height":300,
        "width":500
     },
     "ingredients":[
        "1 onion, diced",
        "5 garlic cloves, minced",
        "4 boneless, skinless chicken breasts, cut into cubes",
        "One 28-ounce can tomato purée",
        "1 cup plain yogurt",
        "3 tablespoons garam masala",
        "1 tablespoon cumin",
        "1 teaspoon coriander",
        "1 teaspoon cayenne pepper",
        "Salt and freshly ground black pepper to taste",
        "1 cup heavy cream",
        "¼ cup fresh cilantro",
        "Steamed rice, for serving"
     ],
     "recipe":[
        "In your slow cooker, combine the onion with the garlic and cubed chicken breasts.",
        "In a large bowl, stir together the tomato puree with the yogurt, garam masala, cumin, coriander and cayenne pepper; season with salt and pepper.",
        "Pour the mixture over the chicken in the slow cooker.",
        "Cook on low for 6 hours.",
        "Stir in the heavy cream and cook for 10 minutes more.",
        "Garnish the chicken with ¼ cup chopped fresh cilantro. Serve with steamed rice."
     ]
  }
]